:PREAMBLE:
#+title: Epkgs: Overview
#+setupfile: .orgconfig
#+name: setup
#+begin_src emacs-lisp :results silent
  (require 'emir)
#+end_src
#+name: addheader
#+header: :var rows="" :var header=""
#+begin_src elisp :hlines yes :results none
  (epkg-add-org-header rows header)
#+end_src
[[https://emacsmirror.net/stats][up]]
:END:
* Summary
:PROPERTIES:
:ID:       023e4161-8c52-44e7-8f26-dfddbfc016f4
:END:
#+name: summary
#+begin_src emacs-lisp
  (require 'finder-inf)
  (let* ((builtin 472)
         ;; This is a bit costly.
         ;; (builtin (length (emir--builtin-packages-alist)))
         ;; This does not include "org", "tramp" and "transient".
         (builtin-emir (length (epkgs 'name [builtin])))
         (shelved      (length (epkgs 'name [shelved])))
         (table `(("" "Epkg" "Mirror" "Attic" "Emacs" "GNU Elpa" "NonGNU Elpa" "Melpa")
                  hline
                  (builtin     ,builtin-emir "" "" ,builtin  0 "" "")
                  (gnu-elpa     0  0  "" ""  0 "" "")
                  (nongnu-elpa  0  0  "" "" ""  0 "")
                  hline
                  (github       0  0 "" ""  0  0  0)
                  (gitlab       0  0 "" ""  0  0  0)
                  (codeberg     0  0 "" ""  0  0  0)
                  (sourcehut    0  0 "" ""  0  0  0)
                  (gnu          0  0 "" ""  0  0  0)
                  (nongnu       0  0 "" ""  0  0  0)
                  hline
                  (git          0  0 "" ""  0  0  0)
                  (hg           0  0 "" ""  0  0  0)
                  hline
                  (subtree      0  0 "" "" "" "" "")
                  (minority     0  0 "" "" "" "" "")
                  hline
                  (wiki         0  0 "" "" "" "" "")
                  (file         0  0 "" "" "" "" "")
                  hline
                  (orphaned     0  0 "" "" "" ""  0)
                  (shelved     ,shelved "" ,shelved "" "" ""  0)
                  (mirror      "" "" "" "" "" ""  0)
                  hline
                  (secondary   "" "" "" "" "" ""  0)
                  (unreleased  "" "" "" ""  0  0 "")
                  hline)))
    (dolist (class (epkgs 'class [mirrored*]))
      (when (eq class 'core)
        (setq class 'builtin))
      (if-let ((elt (assq class table)))
          (progn
            (cl-incf (nth 1 elt))
            (cl-incf (nth 2 elt)))
        (error "No entry for %s" class)))
    (pcase-dolist (`(,fetcher ,url ,name ,epkg-package ,released)
                   (epkg-sql [:select [class url name epkg-package released]
                              :from gnu-elpa-recipes]))
      (let ((type (pcase (list fetcher released)
                    (`(,_      nil) 'unreleased)
                    (`(core     ,_) 'builtin)
                    (`(internal ,_) 'gnu-elpa)
                    (_ fetcher))))
        (cl-incf (nth 5 (assq type table)))))
    (pcase-dolist (`(,fetcher ,url ,name ,epkg-package ,released)
                   (epkg-sql [:select [class url name epkg-package released]
                              :from nongnu-elpa-recipes]))
      (let ((type (pcase (list fetcher released)
                    (`(,_      nil) 'unreleased)
                    (`(internal ,_) 'nongnu-elpa)
                    (_ fetcher))))
        (cl-incf (nth 6 (assq type table)))))
    (pcase-dolist (`(,fetcher ,url ,name ,epkg-package)
                   (epkg-sql [:select [class url name epkg-package]
                              :from melpa-recipes]))
      (let ((type
             (pcase fetcher
               ((guard (not (equal name epkg-package))) 'secondary)
               ((and 'git (guard (string-prefix-p "https://git.savannah.gnu.org" url))) 'gnu)
               ((and 'git (guard (string-prefix-p "https://git.savannah.nongnu.org" url))) 'nongnu)
               ((and 'github (guard (string-prefix-p "https://github.com/emacsorphanage/" url))) 'orphaned)
               ((and 'github (guard (string-prefix-p "https://github.com/emacsattic/" url))) 'shelved)
               ((and 'github (guard (string-prefix-p "https://github.com/emacsmirror/" url))) 'mirror)
               (_ fetcher))))
        (cl-incf (nth 7 (assq type table)))))
    `(,@table
      ("total"
       ,@(seq-reduce (lambda (acc elt)
                       (cl-mapcar (lambda (a b)
                                    (+ (if (numberp a) a 0)
                                       (if (numberp b) b 0)))
                                  acc elt))
                     (--keep (and (listp it)
                                  (symbolp (car it))
                                  (cdr it))
                             table)
                     '(0 0 0 0 0 0 0)))))
#+end_src
#+results: summary
|             | Epkg | Mirror | Attic | Emacs | GNU Elpa | NonGNU Elpa | Melpa |
|-------------+------+--------+-------+-------+----------+-------------+-------|
| builtin     |  469 |        |       |   472 |       16 |             |       |
| gnu-elpa    |  144 |    144 |       |       |      134 |             |       |
| nongnu-elpa |    0 |      0 |       |       |          |           1 |       |
|-------------+------+--------+-------+-------+----------+-------------+-------|
| github      | 5139 |   5139 |       |       |      154 |         146 |  4571 |
| gitlab      |  175 |    175 |       |       |       18 |          13 |   156 |
| codeberg    |   64 |     64 |       |       |        1 |          17 |    64 |
| sourcehut   |   65 |     65 |       |       |       20 |           4 |    44 |
| gnu         |   10 |     10 |       |       |        8 |           0 |     1 |
| nongnu      |    8 |      8 |       |       |        3 |           0 |     3 |
|-------------+------+--------+-------+-------+----------+-------------+-------|
| git         |  106 |    106 |       |       |       14 |           3 |    92 |
| hg          |   16 |     16 |       |       |        1 |           0 |    14 |
|-------------+------+--------+-------+-------+----------+-------------+-------|
| subtree     |   21 |     21 |       |       |          |             |       |
| minority    |    9 |      9 |       |       |          |             |       |
|-------------+------+--------+-------+-------+----------+-------------+-------|
| wiki        |  591 |    591 |       |       |          |             |       |
| file        |   53 |     53 |       |       |          |             |       |
|-------------+------+--------+-------+-------+----------+-------------+-------|
| orphaned    |  138 |    138 |       |       |          |             |   104 |
| shelved     | 1484 |        |  1484 |       |          |             |    18 |
| mirror      |      |        |       |       |          |             |    10 |
|-------------+------+--------+-------+-------+----------+-------------+-------|
| secondary   |      |        |       |       |          |             |   236 |
| unreleased  |      |        |       |       |        8 |           1 |       |
|-------------+------+--------+-------+-------+----------+-------------+-------|
| total       | 8492 |   6539 |  1484 |   472 |      377 |         185 |  5313 |

- Most built-in packages are not mirrored.  They are included in the
  Epkg database, but no individual repositories exist for them on the
  Emacsmirror.

- "Core" packages (i.e., those that are also distributed on GNU Elpa
  for use with older Emacs releases) used to be mirrored but no tool
  exists that is truely capable of doing that reliably and
  efficiently, so these repositories ended up never being updated and
  were removed.

- Three built-in packages (~org~, ~tramp~ and ~transient~) are mirrored, but
  in those cases the Emacsmirror tracks the upstream repositories, not
  the version in Emacs, which explains the apparent discrepancy in the
  ~builtin~ row.

- The Emacsmirror prefers mirroring packages from the upstream
  repository, even when they are also available from GNU Elpa.
  That explaining the apparent discrepancy in the ~gnu-elpa~ row.

- Melpa gets some packages from the Emacsmirror (~mirror~ row), because
  for one reason or another it is not able to get them directly from
  upstream.

- Melpa also gets some packages from the Emacsattic (~shelved~ row),
  likely because the upstream repository has disappeared.  Such
  packages are "shelved", that is, they are moved from the Emacsmirror
  to the Emacsattic.  Melpa doesn't support demoting packages like
  this, so here we tend to keep them around longer, treating the attic
  as the "upstream".

- When a repository is used to maintain a "main" package as well
  as one or more "extentions" to that package, then Melpa often
  distributes these packages individually, while the Emacsmirror
  does not split up such repositories into multiple packages.
  Such "secondary packages" are accounted for in the ~secondary~
  row and listed in the "Shared repository" table below.

* Emacs
:PROPERTIES:
:ID:       d33670d0-33bd-4db5-93d7-57357ac25678
:END:
** Prefer elpa
:PROPERTIES:
:ID:       0d5482d5-f620-4ae4-92ab-dcc4cb096e08
:END:
#+name: builtin-prefer-elpa
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Class"))
  (epkg-sql [:select :distinct [packages:name packages:class]
             :from [packages builtin-libraries]
             :where (= packages:name builtin-libraries:package)
             :and packages:class :in $v1
             :order-by [(asc packages:name)]]
            [gnu-elpa core])
#+end_src
#+results: builtin-prefer-elpa

** Prefer upstream
:PROPERTIES:
:ID:       43da9d6f-fffb-420f-af20-96f069324cce
:END:
#+name: builtin-prefer-upstream
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Class"))
  (epkg-sql [:select :distinct [packages:name packages:class]
             :from [packages builtin-libraries]
             :where (= packages:name builtin-libraries:package)
             :and packages:class :not :in $v1
             :order-by [(asc packages:name)]]
            [builtin gnu-elpa core])
#+end_src
#+results: builtin-prefer-upstream
| Package (3) | Class  |
|-------------+--------|
| org         | gnu    |
| tramp       | gnu    |
| transient   | github |

* GNU Elpa
:PROPERTIES:
:ID:       6aff2bdd-72bd-4902-80ce-56a8d1c911f2
:END:
** New
:PROPERTIES:
:ID:       de3995d6-9c4e-4014-8233-fd4e0e0c4440
:END:
#+name: gnu-elpa-new
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Class" "Url"))
  (mapcan (pcase-lambda (`(,name ,class ,url))
            (and (not (emir--config name :delayed))
                 (not (emir--config name :secondary))
                 (not (emir--config name :builtin-preferred))
                 (list (list name class (if (eq class 'core) "" url)))))
          (epkg-sql [:select [name class url]
                     :from gnu-elpa-recipes
                     :where (or (isnull epkg-package)
                                ;; FIXME (= class 'core)
                                )
                     :order-by [(asc name)]]))
#+end_src
#+results: gnu-elpa-new
| Package (1) | Class     | Url                                      |
|-------------+-----------+------------------------------------------|
| jarchive    | sourcehut | https://git.sr.ht/~dannyfreeman/jarchive |

** Delayed
:PROPERTIES:
:ID:       d846eae7-e7a9-4b3b-be50-655f9736d770
:END:
#+name: gnu-elpa-delayed
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Elpa" "Reason"))
  (seq-keep (pcase-lambda (`(,name ,class))
              (and-let* ((reason (emir--config name :delayed)))
                (list name class reason)))
            (epkg-sql [:select [name class]
                       :from gnu-elpa-recipes
                       :where (isnull epkg-package)
                       :order-by [(asc name)]]))
#+end_src
#+results: gnu-elpa-delayed

** Unreleased
:PROPERTIES:
:ID:       abd15ba1-082f-411d-a557-7f5ff0e0200a
:END:
#+name: gnu-elpa-unreleased
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Elpa"))
  (epkg-sql [:select [name class]
             :from gnu-elpa-recipes
             :where (and (in class $v1)
                         (isnull released))
             :order-by [(asc name)]]
            [subtree external])
#+end_src
#+results: gnu-elpa-unreleased

** Shelved
:PROPERTIES:
:ID:       b17f6889-621c-45ec-bbbd-f433ba1ab06c
:END:
#+name: gnu-elpa-shelved
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Elpa"))
  (epkg-sql [:select :distinct [packages:name gnu-elpa-recipes:class]
             :from [packages gnu-elpa-recipes]
             :where (= packages:name gnu-elpa-recipes:name)
             :and (= packages:class 'shelved)
             :order-by [(asc packages:name)]])
#+end_src
#+results: gnu-elpa-shelved

** Prefer builtin
:PROPERTIES:
:ID:       7a20ccb7-7e22-4110-aaae-02cdc725398f
:END:
#+name: gnu-elpa-prefer-builtin
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Elpa" "Reason"))
  (mapcar (pcase-lambda (`(,name ,class))
            (list name class
                  (or (emir--config name :builtin-preferred) "")))
          (epkg-sql [:select :distinct [packages:name gnu-elpa-recipes:class]
                     :from [packages gnu-elpa-recipes]
                     :where (= packages:name gnu-elpa-recipes:name)
                     :and (= packages:class 'builtin)
                     :order-by [(asc packages:name)]]))
#+end_src
#+results: gnu-elpa-prefer-builtin
| Package (18) | Elpa     | Reason              |
|--------------+----------+---------------------|
| cl-generic   | internal | backport of builtin |
| cl-lib       | internal | backport of builtin |
| eldoc        | core     |                     |
| erc          | core     |                     |
| flymake      | core     |                     |
| jsonrpc      | core     |                     |
| let-alist    | core     |                     |
| map          | core     |                     |
| nadvice      | internal | backport of builtin |
| ntlm         | core     |                     |
| project      | core     |                     |
| python       | core     |                     |
| seq          | internal | backport of builtin |
| so-long      | core     |                     |
| soap-client  | core     |                     |
| svg          | core     |                     |
| verilog-mode | core     |                     |
| xref         | core     |                     |

** Prefer Elpa despite :url
:PROPERTIES:
:ID:       14eaeffa-20a4-4e4e-a3ec-cb0711b0c08d
:END:
#+name: gnu-elpa-prefer-elpa
#+begin_src emacs-lisp :post addheader(*this*,'("Package" ":url"))
  (let ((alist (emir-gelpa--recipes-alist emir-gnu-elpa-repository)))
    (seq-keep (pcase-lambda (`(,name ,_class ,_elpa))
                (and-let* ((url (plist-get (cdr (assoc name alist)) :url)))
                  (list name url)))
              (epkg-sql [:select :distinct [packages:name
                                            packages:class
                                            gnu-elpa-recipes:class]
                         :from [packages gnu-elpa-recipes]
                         :where (= packages:name gnu-elpa-recipes:epkg-package)
                         :and packages:class :in $v1
                         :order-by [(asc gnu-elpa-recipes:url)
                                    (asc packages:name)]]
                        [gnu-elpa])))
#+end_src
#+results: gnu-elpa-prefer-elpa
| Package (18)        | :url                                              |
|---------------------+---------------------------------------------------|
| paced               | bzr::bzr://bzr.savannah.nongnu.org/paced-el/trunk |
| org-edna            | bzr::https://bzr.savannah.gnu.org/r/org-edna-el   |
| vcl-mode            | git://git.gnu.org.ua/vcl-mode                     |
| auto-overlays       | http://www.dr-qubit.org/git/predictive.git        |
| dict-tree           | http://www.dr-qubit.org/git/predictive.git        |
| heap                | http://www.dr-qubit.org/git/predictive.git        |
| queue               | http://www.dr-qubit.org/git/predictive.git        |
| tNFA                | http://www.dr-qubit.org/git/predictive.git        |
| trie                | http://www.dr-qubit.org/git/predictive.git        |
| setup               | https://git.sr.ht/~pkal/setup                     |
| phps-mode           | https://github.com/cjohansson/emacs-phps-mode     |
| clipboard-collector | https://github.com/clemera/clipboard-collector    |
| ebdb                | https://github.com/girzel/ebdb.git                |
| chess               | https://github.com/jwiegley/emacs-chess.git       |
| ioccur              | https://github.com/thierryvolpiatto/ioccur.git    |
| ediprolog           | https://github.com/triska/ediprolog               |
| persist             | https://gitlab.com/phillord/persist               |
| bluetooth           | https://gitlab.com/rstocker/emacs-bluetooth       |

** Prefer upstream
:PROPERTIES:
:ID:       4ff2af7f-eaa4-461c-869f-a2978821320d
:END:
#+name: gnu-elpa-prefer-upstream
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Class" "Elpa" "Link"))
  (seq-keep (pcase-lambda (`(,name ,class ,elpa))
              (and (not (and (eq class 'core)
                             (eq elpa 'core)))
                   (list name class elpa (epkg-org-link name))))
            (epkg-sql [:select :distinct [packages:name
                                          packages:class
                                          gnu-elpa-recipes:class]
                       :from [packages gnu-elpa-recipes]
                       :where (= packages:name gnu-elpa-recipes:epkg-package)
                       :and packages:class :not :in $v1
                       :order-by [(asc packages:name)]]
                      [builtin gnu-elpa shelved]))
#+end_src
#+results: gnu-elpa-prefer-upstream
| Package (208)              | Class     | Elpa      | Link                                            |
|----------------------------+-----------+-----------+-------------------------------------------------|
| ace-window                 | github    | github    | [[https://github.com/abo-abo/ace-window][abo-abo/ace-window]]                              |
| ack                        | github    | github    | [[https://github.com/leoliu/ack-el][leoliu/ack-el]]                                   |
| aggressive-indent          | github    | github    | [[https://github.com/Malabarba/aggressive-indent-mode][Malabarba/aggressive-indent-mode]]                |
| agitate                    | sourcehut | sourcehut | [[https://git.sr.ht/~protesilaos/agitate][protesilaos/agitate]]                             |
| ahungry-theme              | github    | github    | [[https://github.com/ahungry/color-theme-ahungry][ahungry/color-theme-ahungry]]                     |
| aircon-theme               | sourcehut | sourcehut | [[https://git.sr.ht/~chambln/aircon-theme.el][chambln/aircon-theme.el]]                         |
| async                      | github    | github    | [[https://github.com/jwiegley/emacs-async][jwiegley/emacs-async]]                            |
| auctex                     | gnu       | gnu       | [[https://savannah.gnu.org/projects/auctex][gnu:auctex]]                                      |
| avy                        | github    | github    | [[https://github.com/abo-abo/avy][abo-abo/avy]]                                     |
| bbdb                       | nongnu    | nongnu    | [[http://bbdb.sourceforge.net][nongnu:bbdb]]                                     |
| beacon                     | github    | github    | [[https://github.com/Malabarba/beacon][Malabarba/beacon]]                                |
| blist                      | gitlab    | gitlab    | [[https://gitlab.com/mmemmew/blist][mmemmew/blist]]                                   |
| bnf-mode                   | github    | github    | [[https://github.com/sergeyklay/bnf-mode][sergeyklay/bnf-mode]]                             |
| boxy                       | gitlab    | gitlab    | [[https://gitlab.com/tygrdev/boxy][tygrdev/boxy]]                                    |
| boxy-headings              | gitlab    | gitlab    | [[https://gitlab.com/tygrdev/boxy-headings][tygrdev/boxy-headings]]                           |
| buffer-env                 | github    | github    | [[https://github.com/astoff/buffer-env][astoff/buffer-env]]                               |
| buffer-expose              | github    | github    | [[https://github.com/clemera/buffer-expose][clemera/buffer-expose]]                           |
| bug-hunter                 | github    | github    | [[https://github.com/Malabarba/elisp-bug-hunter][Malabarba/elisp-bug-hunter]]                      |
| cape                       | github    | github    | [[https://github.com/minad/cape][minad/cape]]                                      |
| capf-autosuggest           | git       | git       | [[https://repo.or.cz/emacs-capf-autosuggest.git]]   |
| cobol-mode                 | git       | internal  |                                                 |
| code-cells                 | github    | github    | [[https://github.com/astoff/code-cells.el][astoff/code-cells.el]]                            |
| comint-mime                | github    | github    | [[https://github.com/astoff/comint-mime][astoff/comint-mime]]                              |
| compact-docstrings         | github    | github    | [[https://github.com/cpitclaudel/compact-docstrings][cpitclaudel/compact-docstrings]]                  |
| company                    | github    | github    | [[https://github.com/company-mode/company-mode][company-mode/company-mode]]                       |
| company-math               | github    | github    | [[https://github.com/vspinu/company-math][vspinu/company-math]]                             |
| company-statistics         | github    | github    | [[https://github.com/company-mode/company-statistics][company-mode/company-statistics]]                 |
| compat                     | sourcehut | sourcehut | [[https://git.sr.ht/~pkal/compat][pkal/compat]]                                     |
| consult                    | github    | github    | [[https://github.com/minad/consult][minad/consult]]                                   |
| consult-recoll             | codeberg  | codeberg  | [[https://codeberg.org/jao/consult-recoll][jao/consult-recoll]]                              |
| context-coloring           | github    | github    | [[https://github.com/jacksonrayhamilton/context-coloring][jacksonrayhamilton/context-coloring]]             |
| corfu                      | github    | github    | [[https://github.com/minad/corfu][minad/corfu]]                                     |
| coterm                     | git       | git       | [[https://repo.or.cz/emacs-coterm.git]]             |
| cpio-mode                  | github    | github    | [[https://github.com/dlewan/cpio-mode][dlewan/cpio-mode]]                                |
| cpupower                   | gitlab    | gitlab    | [[https://gitlab.com/steve-emacs-stuff/cpupower-el][steve-emacs-stuff/cpupower-el]]                   |
| crdt                       | git       | git       | [[https://code.librehq.com/qhong/crdt.el]]          |
| csharp-mode                | github    | github    | [[https://github.com/emacs-csharp/csharp-mode][emacs-csharp/csharp-mode]]                        |
| cursory                    | sourcehut | sourcehut | [[https://git.sr.ht/~protesilaos/cursory][protesilaos/cursory]]                             |
| darkroom                   | github    | github    | [[https://github.com/joaotavora/darkroom][joaotavora/darkroom]]                             |
| dash                       | github    | github    | [[https://github.com/magnars/dash.el][magnars/dash.el]]                                 |
| dbus-codegen               | github    | github    | [[https://github.com/ueno/dbus-codegen-el][ueno/dbus-codegen-el]]                            |
| delight                    | nongnu    | gnu       | [[https://savannah.nongnu.org/projects/delight][nongnu:delight]]                                  |
| denote                     | sourcehut | sourcehut | [[https://git.sr.ht/~protesilaos/denote][protesilaos/denote]]                              |
| detached                   | sourcehut | sourcehut | [[https://git.sr.ht/~niklaseklund/detached.el][niklaseklund/detached.el]]                        |
| devdocs                    | github    | github    | [[https://github.com/astoff/devdocs.el][astoff/devdocs.el]]                               |
| diff-hl                    | github    | github    | [[https://github.com/dgutov/diff-hl][dgutov/diff-hl]]                                  |
| diffview                   | github    | github    | [[https://github.com/mgalgs/diffview-mode][mgalgs/diffview-mode]]                            |
| diminish                   | github    | github    | [[https://github.com/myrjola/diminish.el][myrjola/diminish.el]]                             |
| dired-git-info             | github    | github    | [[https://github.com/clemera/dired-git-info][clemera/dired-git-info]]                          |
| disk-usage                 | gitlab    | gitlab    | [[https://gitlab.com/ambrevar/emacs-disk-usage][ambrevar/emacs-disk-usage]]                       |
| doc-toc                    | github    | github    | [[https://github.com/dalanicolai/doc-tools-toc][dalanicolai/doc-tools-toc]]                       |
| dts-mode                   | github    | internal  | [[https://github.com/bgamari/dts-mode][bgamari/dts-mode]]                                |
| easy-escape                | github    | github    | [[https://github.com/cpitclaudel/easy-escape][cpitclaudel/easy-escape]]                         |
| easy-kill                  | github    | github    | [[https://github.com/leoliu/easy-kill][leoliu/easy-kill]]                                |
| eev                        | github    | github    | [[https://github.com/edrx/eev][edrx/eev]]                                        |
| ef-themes                  | sourcehut | sourcehut | [[https://git.sr.ht/~protesilaos/ef-themes][protesilaos/ef-themes]]                           |
| eglot                      | github    | core      | [[https://github.com/joaotavora/eglot][joaotavora/eglot]]                                |
| eldoc-eval                 | github    | github    | [[https://github.com/thierryvolpiatto/eldoc-eval][thierryvolpiatto/eldoc-eval]]                     |
| electric-spacing           | github    | internal  | [[https://github.com/xwl/electric-spacing][xwl/electric-spacing]]                            |
| embark                     | github    | github    | [[https://github.com/oantolin/embark][oantolin/embark]]                                 |
| ement                      | github    | github    | [[https://github.com/alphapapa/ement.el][alphapapa/ement.el]]                              |
| emms                       | gnu       | gnu       | [[http://www.gnu.org/software/emms][gnu:emms]]                                        |
| engrave-faces              | github    | github    | [[https://github.com/tecosaur/engrave-faces][tecosaur/engrave-faces]]                          |
| enwc                       | hg        | hg        | [[https://savannah.nongnu.org/p/enwc]]              |
| ergoemacs-mode             | github    | github    | [[https://github.com/ergoemacs/ergoemacs-mode][ergoemacs/ergoemacs-mode]]                        |
| ess                        | github    | github    | [[https://github.com/emacs-ess/ESS][emacs-ess/ESS]]                                   |
| expand-region              | github    | github    | [[https://github.com/magnars/expand-region.el][magnars/expand-region.el]]                        |
| exwm                       | github    | github    | [[https://github.com/ch11ng/exwm][ch11ng/exwm]]                                     |
| flymake-proselint          | sourcehut | sourcehut | [[https://git.sr.ht/~manuel-uberti/flymake-proselint][manuel-uberti/flymake-proselint]]                 |
| fontaine                   | sourcehut | sourcehut | [[https://git.sr.ht/~protesilaos/fontaine][protesilaos/fontaine]]                            |
| frog-menu                  | github    | github    | [[https://github.com/clemera/frog-menu][clemera/frog-menu]]                               |
| ftable                     | github    | github    | [[https://github.com/casouri/ftable][casouri/ftable]]                                  |
| gcmh                       | gitlab    | gitlab    | [[https://gitlab.com/koral/gcmh][koral/gcmh]]                                      |
| ggtags                     | github    | github    | [[https://github.com/leoliu/ggtags][leoliu/ggtags]]                                   |
| gnome-c-style              | github    | github    | [[https://github.com/ueno/gnome-c-style][ueno/gnome-c-style]]                              |
| gpastel                    | github    | git       | [[https://github.com/DamienCassou/gpastel][DamienCassou/gpastel]]                            |
| graphql                    | github    | github    | [[https://github.com/vermiculus/graphql.el][vermiculus/graphql.el]]                           |
| greader                    | gitlab    | gitlab    | [[https://gitlab.com/michelangelo-rodriguez/greader][michelangelo-rodriguez/greader]]                  |
| gtags-mode                 | github    | github    | [[https://github.com/Ergus/gtags-mode][Ergus/gtags-mode]]                                |
| guess-language             | github    | github    | [[https://github.com/tmalsburg/guess-language.el][tmalsburg/guess-language.el]]                     |
| hcel                       | git       | git       | [[https://g.ypei.me/hc.el.git]]                     |
| hiddenquote                | gitlab    | gitlab    | [[https://gitlab.com/mauroaranda/hiddenquote/hiddenquote][mauroaranda/hiddenquote/hiddenquote]]             |
| highlight-escape-sequences | github    | github    | [[https://github.com/dgutov/highlight-escape-sequences][dgutov/highlight-escape-sequences]]               |
| hook-helpers               | nongnu    | nongnu    | [[https://savannah.nongnu.org/projects/hook-helpers-el][nongnu:hook-helpers]]                             |
| hydra                      | github    | github    | [[https://github.com/abo-abo/hydra][abo-abo/hydra]]                                   |
| hyperbole                  | gnu       | gnu       | [[http://www.gnu.org/software/hyperbole][gnu:hyperbole]]                                   |
| ilist                      | gitlab    | gitlab    | [[https://gitlab.com/mmemmew/ilist][mmemmew/ilist]]                                   |
| inspector                  | github    | github    | [[https://github.com/mmontone/emacs-inspector][mmontone/emacs-inspector]]                        |
| isearch-mb                 | github    | github    | [[https://github.com/astoff/isearch-mb][astoff/isearch-mb]]                               |
| ivy                        | github    | github    | [[https://github.com/abo-abo/swiper][abo-abo/swiper]]                                  |
| ivy-explorer               | github    | github    | [[https://github.com/clemera/ivy-explorer][clemera/ivy-explorer]]                            |
| ivy-posframe               | github    | github    | [[https://github.com/tumashu/ivy-posframe][tumashu/ivy-posframe]]                            |
| js2-mode                   | github    | github    | [[https://github.com/mooz/js2-mode][mooz/js2-mode]]                                   |
| json-mode                  | github    | internal  | [[https://github.com/joshwnj/json-mode][joshwnj/json-mode]]                               |
| kind-icon                  | github    | github    | [[https://github.com/jdtsmith/kind-icon][jdtsmith/kind-icon]]                              |
| kiwix                      | git       | internal  | [[https://repo.or.cz/kiwix.el.git]]                 |
| leaf                       | github    | github    | [[https://github.com/conao3/leaf.el][conao3/leaf.el]]                                  |
| lin                        | sourcehut | sourcehut | [[https://git.sr.ht/~protesilaos/lin][protesilaos/lin]]                                 |
| load-relative              | github    | github    | [[https://github.com/rocky/emacs-load-relative][rocky/emacs-load-relative]]                       |
| loc-changes                | github    | github    | [[https://github.com/rocky/emacs-loc-changes][rocky/emacs-loc-changes]]                         |
| loccur                     | github    | github    | [[https://github.com/fourier/loccur][fourier/loccur]]                                  |
| logos                      | gitlab    | sourcehut | [[https://gitlab.com/protesilaos/logos][protesilaos/logos]]                               |
| luwak                      | git       | git       | [[https://g.ypei.me/luwak.git]]                     |
| marginalia                 | github    | github    | [[https://github.com/minad/marginalia][minad/marginalia]]                                |
| math-symbol-lists          | github    | github    | [[https://github.com/vspinu/math-symbol-lists][vspinu/math-symbol-lists]]                        |
| mct                        | gitlab    | gitlab    | [[https://gitlab.com/protesilaos/mct][protesilaos/mct]]                                 |
| mines                      | github    | github    | [[https://github.com/calancha/Minesweeper][calancha/Minesweeper]]                            |
| minibuffer-header          | github    | github    | [[https://github.com/rougier/minibuffer-header][rougier/minibuffer-header]]                       |
| mmm-mode                   | github    | github    | [[https://github.com/dgutov/mmm-mode][dgutov/mmm-mode]]                                 |
| modus-themes               | sourcehut | core      | [[https://git.sr.ht/~protesilaos/modus-themes][protesilaos/modus-themes]]                        |
| multishell                 | github    | github    | [[https://github.com/kenmanheimer/EmacsMultishell][kenmanheimer/EmacsMultishell]]                    |
| muse                       | github    | github    | [[https://github.com/alexott/muse][alexott/muse]]                                    |
| nameless                   | github    | github    | [[https://github.com/Malabarba/Nameless][Malabarba/Nameless]]                              |
| names                      | github    | github    | [[https://github.com/Malabarba/names][Malabarba/names]]                                 |
| nano-agenda                | github    | github    | [[https://github.com/rougier/nano-agenda][rougier/nano-agenda]]                             |
| nano-modeline              | github    | github    | [[https://github.com/rougier/nano-modeline][rougier/nano-modeline]]                           |
| nano-theme                 | github    | github    | [[https://github.com/rougier/nano-theme][rougier/nano-theme]]                              |
| notmuch-indicator          | sourcehut | sourcehut | [[https://git.sr.ht/~protesilaos/notmuch-indicator][protesilaos/notmuch-indicator]]                   |
| ob-haxe                    | github    | github    | [[https://github.com/ianxm/ob-haxe.el][ianxm/ob-haxe.el]]                                |
| objed                      | github    | github    | [[https://github.com/clemera/objed][clemera/objed]]                                   |
| on-screen                  | github    | github    | [[https://github.com/michael-heerdegen/on-screen.el][michael-heerdegen/on-screen.el]]                  |
| orderless                  | github    | github    | [[https://github.com/oantolin/orderless][oantolin/orderless]]                              |
| org                        | gnu       | gnu       | [[https://git.savannah.gnu.org/cgit/org.git]]       |
| org-contacts               | git       | git       | [[https://repo.or.cz/org-contacts.git]]             |
| org-modern                 | github    | github    | [[https://github.com/minad/org-modern][minad/org-modern]]                                |
| org-notify                 | github    | github    | [[https://github.com/p-m/org-notify][p-m/org-notify]]                                  |
| org-real                   | gitlab    | gitlab    | [[https://gitlab.com/tygrdev/org-real][tygrdev/org-real]]                                |
| org-remark                 | github    | github    | [[https://github.com/nobiot/org-remark][nobiot/org-remark]]                               |
| org-transclusion           | github    | github    | [[https://github.com/nobiot/org-transclusion][nobiot/org-transclusion]]                         |
| osm                        | github    | github    | [[https://github.com/minad/osm][minad/osm]]                                       |
| pabbrev                    | github    | github    | [[https://github.com/phillord/pabbrev][phillord/pabbrev]]                                |
| parsec                     | github    | github    | [[https://github.com/cute-jumper/parsec.el][cute-jumper/parsec.el]]                           |
| parser-generator           | github    | github    | [[https://github.com/cjohansson/emacs-parser-generator][cjohansson/emacs-parser-generator]]               |
| perl-doc                   | github    | github    | [[https://github.com/HaraldJoerg/emacs-perl-doc][HaraldJoerg/emacs-perl-doc]]                      |
| pinentry                   | github    | github    | [[https://github.com/ueno/pinentry-el][ueno/pinentry-el]]                                |
| plz                        | github    | github    | [[https://github.com/alphapapa/plz.el][alphapapa/plz.el]]                                |
| poke                       | gnu       | gnu       | [[https://git.savannah.gnu.org/cgit/poke.git]]      |
| poke-mode                  | gnu       | gnu       | [[https://git.savannah.gnu.org/cgit/poke-mode.git]] |
| polymode                   | github    | github    | [[https://github.com/polymode/polymode][polymode/polymode]]                               |
| posframe                   | github    | github    | [[https://github.com/tumashu/posframe][tumashu/posframe]]                                |
| pq                         | github    | github    | [[https://github.com/anse1/emacs-libpq][anse1/emacs-libpq]]                               |
| pulsar                     | gitlab    | sourcehut | [[https://gitlab.com/protesilaos/pulsar][protesilaos/pulsar]]                              |
| pyim                       | github    | github    | [[https://github.com/tumashu/pyim][tumashu/pyim]]                                    |
| pyim-basedict              | github    | github    | [[https://github.com/tumashu/pyim-basedict][tumashu/pyim-basedict]]                           |
| realgud                    | github    | github    | [[https://github.com/realgud/realgud][realgud/realgud]]                                 |
| realgud-ipdb               | github    | github    | [[https://github.com/realgud/realgud-ipdb][realgud/realgud-ipdb]]                            |
| realgud-jdb                | github    | github    | [[https://github.com/realgud/realgud-jdb][realgud/realgud-jdb]]                             |
| realgud-lldb               | github    | github    | [[https://github.com/realgud/realgud-lldb][realgud/realgud-lldb]]                            |
| realgud-node-debug         | github    | github    | [[https://github.com/realgud/realgud-node-debug][realgud/realgud-node-debug]]                      |
| realgud-node-inspect       | github    | github    | [[https://github.com/realgud/realgud-node-inspect][realgud/realgud-node-inspect]]                    |
| realgud-trepan-ni          | github    | github    | [[https://github.com/realgud/realgud-trepan-ni][realgud/realgud-trepan-ni]]                       |
| rec-mode                   | gnu       | gnu       | [[https://www.gnu.org/software/recutils][gnu:rec-mode]]                                    |
| relint                     | github    | github    | [[https://github.com/mattiase/relint][mattiase/relint]]                                 |
| rich-minority              | github    | github    | [[https://github.com/Malabarba/rich-minority][Malabarba/rich-minority]]                         |
| rt-liberation              | nongnu    | nongnu    | [[http://www.nongnu.org/rtliber][nongnu:rt-liberation]]                            |
| satchel                    | sourcehut | sourcehut | [[https://git.sr.ht/~theo/satchel][theo/satchel]]                                    |
| scanner                    | gitlab    | gitlab    | [[https://gitlab.com/rstocker/scanner][rstocker/scanner]]                                |
| shell-command+             | sourcehut | sourcehut | [[https://git.sr.ht/~pkal/shell-command-plus][pkal/shell-command-plus]]                         |
| sketch-mode                | github    | github    | [[https://github.com/dalanicolai/sketch-mode][dalanicolai/sketch-mode]]                         |
| slime-volleyball           | github    | internal  | [[https://github.com/fitzsim/slime-volleyball][fitzsim/slime-volleyball]]                        |
| smalltalk-mode             | nongnu    | internal  | [[https://savannah.nongnu.org/projects/smalltalk][nongnu:smalltalk-mode]]                           |
| sotlisp                    | github    | github    | [[https://github.com/Malabarba/speed-of-thought-lisp][Malabarba/speed-of-thought-lisp]]                 |
| spinner                    | github    | github    | [[https://github.com/Malabarba/spinner.el][Malabarba/spinner.el]]                            |
| sql-indent                 | github    | github    | [[https://github.com/bsvingen/sql-indent][bsvingen/sql-indent]]                             |
| srht                       | sourcehut | sourcehut | [[https://git.sr.ht/~akagi/srht.el][akagi/srht.el]]                                   |
| ssh-deploy                 | github    | github    | [[https://github.com/cjohansson/emacs-ssh-deploy][cjohansson/emacs-ssh-deploy]]                     |
| svg-lib                    | github    | github    | [[https://github.com/rougier/svg-lib][rougier/svg-lib]]                                 |
| svg-tag-mode               | github    | github    | [[https://github.com/rougier/svg-tag-mode][rougier/svg-tag-mode]]                            |
| system-packages            | gitlab    | gitlab    | [[https://gitlab.com/jabranham/system-packages][jabranham/system-packages]]                       |
| systemd                    | github    | internal  | [[https://github.com/holomorph/systemd-mode][holomorph/systemd-mode]]                          |
| taxy                       | github    | github    | [[https://github.com/alphapapa/taxy.el][alphapapa/taxy.el]]                               |
| taxy-magit-section         | github    | github    | [[https://github.com/alphapapa/taxy.el][alphapapa/taxy.el]]                               |
| temp-buffer-browse         | github    | github    | [[https://github.com/leoliu/temp-buffer-browse][leoliu/temp-buffer-browse]]                       |
| tempel                     | github    | github    | [[https://github.com/minad/tempel][minad/tempel]]                                    |
| test-simple                | github    | github    | [[https://github.com/rocky/emacs-test-simple][rocky/emacs-test-simple]]                         |
| tiny                       | github    | github    | [[https://github.com/abo-abo/tiny][abo-abo/tiny]]                                    |
| tmr                        | sourcehut | sourcehut | [[https://git.sr.ht/~protesilaos/tmr][protesilaos/tmr]]                                 |
| tomelr                     | github    | github    | [[https://github.com/kaushalmodi/tomelr][kaushalmodi/tomelr]]                              |
| topspace                   | github    | github    | [[https://github.com/trevorpogue/topspace][trevorpogue/topspace]]                            |
| tramp                      | gnu       | gnu       | [[https://savannah.gnu.org/projects/tramp][gnu:tramp]]                                       |
| tramp-nspawn               | github    | github    | [[https://github.com/bjc/tramp-nspawn][bjc/tramp-nspawn]]                                |
| transient                  | github    | github    | [[https://github.com/magit/transient][magit/transient]]                                 |
| triples                    | github    | github    | [[https://github.com/ahyatt/triples][ahyatt/triples]]                                  |
| undo-tree                  | gitlab    | gitlab    | [[https://gitlab.com/tsc25/undo-tree][tsc25/undo-tree]]                                 |
| url-scgi                   | github    | github    | [[https://github.com/skangas/url-scgi][skangas/url-scgi]]                                |
| use-package                | github    | github    | [[https://github.com/jwiegley/use-package][jwiegley/use-package]]                            |
| validate                   | github    | github    | [[https://github.com/Malabarba/validate.el][Malabarba/validate.el]]                           |
| valign                     | github    | github    | [[https://github.com/casouri/valign][casouri/valign]]                                  |
| vc-backup                  | sourcehut | sourcehut | [[https://git.sr.ht/~pkal/vc-backup][pkal/vc-backup]]                                  |
| vc-got                     | github    | git       | [[https://github.com/omar-polo/vc-got][omar-polo/vc-got]]                                |
| vc-hgcmd                   | github    | github    | [[https://github.com/muffinmad/emacs-vc-hgcmd][muffinmad/emacs-vc-hgcmd]]                        |
| vdiff                      | github    | github    | [[https://github.com/justbur/emacs-vdiff][justbur/emacs-vdiff]]                             |
| vertico                    | github    | github    | [[https://github.com/minad/vertico][minad/vertico]]                                   |
| vertico-posframe           | github    | github    | [[https://github.com/tumashu/vertico-posframe][tumashu/vertico-posframe]]                        |
| vlf                        | github    | github    | [[https://github.com/m00natic/vlfi][m00natic/vlfi]]                                   |
| vundo                      | github    | github    | [[https://github.com/casouri/vundo][casouri/vundo]]                                   |
| wcheck-mode                | github    | github    | [[https://github.com/tlikonen/wcheck-mode][tlikonen/wcheck-mode]]                            |
| wconf                      | github    | github    | [[https://github.com/ilohmar/wconf][ilohmar/wconf]]                                   |
| web-server                 | github    | github    | [[https://github.com/eschulte/emacs-web-server][eschulte/emacs-web-server]]                       |
| webfeeder                  | gitlab    | gitlab    | [[https://gitlab.com/ambrevar/emacs-webfeeder][ambrevar/emacs-webfeeder]]                        |
| websocket                  | github    | github    | [[https://github.com/ahyatt/emacs-websocket][ahyatt/emacs-websocket]]                          |
| which-key                  | github    | github    | [[https://github.com/justbur/emacs-which-key][justbur/emacs-which-key]]                         |
| windower                   | gitlab    | gitlab    | [[https://gitlab.com/ambrevar/emacs-windower][ambrevar/emacs-windower]]                         |
| xelb                       | github    | github    | [[https://github.com/ch11ng/xelb][ch11ng/xelb]]                                     |
| xr                         | github    | github    | [[https://github.com/mattiase/xr][mattiase/xr]]                                     |
| yasnippet                  | github    | github    | [[https://github.com/joaotavora/yasnippet][joaotavora/yasnippet]]                            |
| ztree                      | github    | github    | [[https://github.com/fourier/ztree][fourier/ztree]]                                   |
| zuul                       | sourcehut | sourcehut | [[https://git.sr.ht/~niklaseklund/zuul.el][niklaseklund/zuul.el]]                            |

* NonGNU Elpa
:PROPERTIES:
:ID:       85ff91e5-4565-433f-9e01-58cb9ff1bf03
:END:
** New
:PROPERTIES:
:ID:       0e3e300d-2683-4600-829a-024f4c1bd34e
:END:
#+name: nongnu-elpa-new
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Class" "Url"))
  (mapcan (pcase-lambda (`(,name ,class ,url))
            (and (not (emir--config name :delayed))
                 (not (emir--config name :secondary))
                 (not (emir--config name :builtin-preferred))
                 (list (list name class (if (eq class 'core) "" url)))))
          (epkg-sql [:select [name class url]
                     :from nongnu-elpa-recipes
                     :where (or (isnull epkg-package)
                                ;; FIXME (= class 'core)
                                )
                     :order-by [(asc name)]]))
#+end_src
#+results: nongnu-elpa-new
| Package (8)      | Class     | Url                                            |
|------------------+-----------+------------------------------------------------|
| corfu-terminal   | codeberg  | https://codeberg.org/akib/emacs-corfu-terminal |
| flymake-popon    | codeberg  | https://codeberg.org/akib/emacs-flymake-popon  |
| haskell-tng-mode | gitlab    | https://gitlab.com/tseenshe/haskell-tng.el     |
| popon            | codeberg  | https://codeberg.org/akib/emacs-popon          |
| subed            | github    | https://github.com/sachac/subed                |
| sweeprolog       | github    | https://github.com/SWI-Prolog/packages-sweep   |
| swsw             | sourcehut | https://git.sr.ht/~dsemy/swsw                  |
| vcomplete        | sourcehut | https://git.sr.ht/~dsemy/vcomplete             |

** Delayed
:PROPERTIES:
:ID:       bb885ac5-e755-4cac-9766-3a40b9075926
:END:
#+name: nongnu-elpa-delayed
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Elpa" "Reason"))
  (seq-keep (pcase-lambda (`(,name ,class))
              (and-let* ((reason (emir--config name :delayed)))
                (list name class reason)))
            (epkg-sql [:select [name class]
                       :from nongnu-elpa-recipes
                       :where (isnull epkg-package)
                       :order-by [(asc name)]]))
#+end_src
#+results: nongnu-elpa-delayed

** Unreleased
:PROPERTIES:
:ID:       20acb40f-27db-4c8f-8a10-cf5a7c84bae7
:END:
#+name: nongnu-elpa-unreleased
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Elpa"))
  (epkg-sql [:select [name class]
             :from nongnu-elpa-recipes
             :where (and (in class $v1)
                         (isnull released))
             :order-by [(asc name)]]
            [subtree external])
#+end_src
#+results: nongnu-elpa-unreleased

** Shelved
:PROPERTIES:
:ID:       1e805a02-8c5b-4d8d-92c0-94c38135582c
:END:
#+name: nongnu-elpa-shelved
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Elpa"))
  (epkg-sql [:select :distinct [packages:name nongnu-elpa-recipes:class]
             :from [packages nongnu-elpa-recipes]
             :where (= packages:name nongnu-elpa-recipes:name)
             :and (= packages:class 'shelved)
             :order-by [(asc packages:name)]])
#+end_src
#+results: nongnu-elpa-shelved
| Package (1)  | Elpa   |
|--------------+--------|
| xah-fly-keys | github |

** Prefer builtin
:PROPERTIES:
:ID:       b2f9c29d-adff-43ea-a91c-6822e74bd6c4
:END:
#+name: nongnu-elpa-prefer-builtin
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Elpa" "Reason"))
  (mapcar (pcase-lambda (`(,name ,class))
            (list name class
                  (or (emir--config name :builtin-preferred) "")))
          (epkg-sql [:select :distinct [packages:name nongnu-elpa-recipes:class]
                     :from [packages nongnu-elpa-recipes]
                     :where (= packages:name nongnu-elpa-recipes:name)
                     :and (= packages:class 'builtin)
                     :order-by [(asc packages:name)]]))
#+end_src
#+results: nongnu-elpa-prefer-builtin

** Prefer Elpa despite :url
:PROPERTIES:
:ID:       824e34c8-1a20-40f4-8040-52d18d718747
:END:
#+name: nongnu-elpa-prefer-elpa
#+begin_src emacs-lisp :post addheader(*this*,'("Package" ":url"))
  (let ((alist (emir-gelpa--recipes-alist emir-nongnu-elpa-repository)))
    (seq-keep (pcase-lambda (`(,name ,_class ,_elpa))
                (and-let* ((url (plist-get (cdr (assoc name alist)) :url)))
                  (list name url)))
              (epkg-sql [:select :distinct [packages:name
                                            packages:class
                                            nongnu-elpa-recipes:class]
                         :from [packages nongnu-elpa-recipes]
                         :where (= packages:name nongnu-elpa-recipes:epkg-package)
                         :and packages:class :in $v1
                         :order-by [(asc nongnu-elpa-recipes:url)
                                    (asc packages:name)]]
                        [gnu-elpa])))
#+end_src
#+results: nongnu-elpa-prefer-elpa

** Prefer upstream
:PROPERTIES:
:ID:       50dddb98-ccef-4bf4-ac1f-69309ccf7974
:END:
#+name: nongnu-elpa-prefer-upstream
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Class" "Elpa" "Link"))
  (seq-keep (pcase-lambda (`(,name ,class ,elpa))
              (and (not (and (eq class 'core)
                             (eq elpa 'core)))
                   (list name class elpa (epkg-org-link name))))
            (epkg-sql [:select :distinct [packages:name
                                          packages:class
                                          nongnu-elpa-recipes:class]
                       :from [packages nongnu-elpa-recipes]
                       :where (= packages:name nongnu-elpa-recipes:epkg-package)
                       :and packages:class :not :in $v1
                       :order-by [(asc packages:name)]]
                      [builtin gnu-elpa shelved]))
#+end_src
#+results: nongnu-elpa-prefer-upstream
| Package (172)         | Class     | Elpa      | Link                                      |
|-----------------------+-----------+-----------+-------------------------------------------|
| afternoon-theme       | github    | github    | [[https://github.com/osener/emacs-afternoon-theme][osener/emacs-afternoon-theme]]              |
| alect-themes          | github    | github    | [[https://github.com/alezost/alect-themes][alezost/alect-themes]]                      |
| ample-theme           | github    | github    | [[https://github.com/jordonbiondo/ample-theme][jordonbiondo/ample-theme]]                  |
| annotate              | github    | github    | [[https://github.com/bastibe/annotate.el][bastibe/annotate.el]]                       |
| anti-zenburn-theme    | github    | github    | [[https://github.com/m00natic/anti-zenburn-theme][m00natic/anti-zenburn-theme]]               |
| anzu                  | orphaned  | github    | [[https://github.com/emacsorphanage/anzu][emacsorphanage/anzu]]                       |
| apache-mode           | github    | github    | [[https://github.com/emacs-php/apache-mode][emacs-php/apache-mode]]                     |
| apropospriate-theme   | github    | github    | [[https://github.com/waymondo/apropospriate-theme][waymondo/apropospriate-theme]]              |
| arduino-mode          | git       | internal  | [[https://repo.or.cz/arduino-mode.git]]       |
| autothemer            | github    | github    | [[https://github.com/sebastiansturm/autothemer][jasonm23/autothemer]]                       |
| better-jumper         | github    | github    | [[https://github.com/gilbertw1/better-jumper][gilbertw1/better-jumper]]                   |
| bind-map              | github    | github    | [[https://github.com/justbur/emacs-bind-map][justbur/emacs-bind-map]]                    |
| bison-mode            | github    | github    | [[https://github.com/Wilfred/bison-mode][Wilfred/bison-mode]]                        |
| boxquote              | github    | github    | [[https://github.com/davep/boxquote.el][davep/boxquote.el]]                         |
| buttercup             | github    | github    | [[https://github.com/jorgenschaefer/emacs-buttercup][jorgenschaefer/emacs-buttercup]]            |
| caml                  | github    | github    | [[https://github.com/ocaml/caml-mode][ocaml/caml-mode]]                           |
| cdlatex               | github    | github    | [[https://github.com/cdominik/cdlatex][cdominik/cdlatex]]                          |
| cider                 | github    | github    | [[https://github.com/clojure-emacs/cider][clojure-emacs/cider]]                       |
| clojure-mode          | github    | github    | [[https://github.com/clojure-emacs/clojure-mode][clojure-emacs/clojure-mode]]                |
| coffee-mode           | github    | github    | [[https://github.com/defunkt/coffee-mode][defunkt/coffee-mode]]                       |
| crux                  | github    | github    | [[https://github.com/bbatsov/crux][bbatsov/crux]]                              |
| cyberpunk-theme       | github    | github    | [[https://github.com/n3mo/cyberpunk-theme.el][n3mo/cyberpunk-theme.el]]                   |
| cycle-at-point        | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-cycle-at-point][ideasman42/emacs-cycle-at-point]]           |
| d-mode                | github    | github    | [[https://github.com/Emacs-D-Mode-Maintainers/Emacs-D-Mode][Emacs-D-Mode-Maintainers/Emacs-D-Mode]]     |
| dart-mode             | github    | github    | [[https://github.com/bradyt/dart-mode][bradyt/dart-mode]]                          |
| diff-ansi             | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-diff-ansi][ideasman42/emacs-diff-ansi]]                |
| doc-show-inline       | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-doc-show-inline][ideasman42/emacs-doc-show-inline]]          |
| dockerfile-mode       | github    | github    | [[https://github.com/spotify/dockerfile-mode][spotify/dockerfile-mode]]                   |
| dracula-theme         | github    | github    | [[https://github.com/dracula/emacs][dracula/emacs]]                             |
| drupal-mode           | github    | github    | [[https://github.com/arnested/drupal-mode][arnested/drupal-mode]]                      |
| edit-indirect         | github    | github    | [[https://github.com/Fanael/edit-indirect][Fanael/edit-indirect]]                      |
| editorconfig          | github    | github    | [[https://github.com/editorconfig/editorconfig-emacs][editorconfig/editorconfig-emacs]]           |
| elixir-mode           | github    | github    | [[https://github.com/elixir-editors/emacs-elixir][elixir-editors/emacs-elixir]]               |
| elpher                | git       | git       | [[https://thelambdalab.xyz/elpher]]           |
| evil                  | github    | github    | [[https://github.com/emacs-evil/evil][emacs-evil/evil]]                           |
| evil-anzu             | orphaned  | github    | [[https://github.com/emacsorphanage/evil-anzu][emacsorphanage/evil-anzu]]                  |
| evil-args             | github    | github    | [[https://github.com/wcsmith/evil-args][wcsmith/evil-args]]                         |
| evil-exchange         | github    | github    | [[https://github.com/Dewdrops/evil-exchange][Dewdrops/evil-exchange]]                    |
| evil-goggles          | github    | github    | [[https://github.com/edkolev/evil-goggles][edkolev/evil-goggles]]                      |
| evil-indent-plus      | github    | github    | [[https://github.com/TheBB/evil-indent-plus][TheBB/evil-indent-plus]]                    |
| evil-lisp-state       | github    | github    | [[https://github.com/syl20bnr/evil-lisp-state][syl20bnr/evil-lisp-state]]                  |
| evil-matchit          | github    | github    | [[https://github.com/redguardtoo/evil-matchit][redguardtoo/evil-matchit]]                  |
| evil-nerd-commenter   | github    | github    | [[https://github.com/redguardtoo/evil-nerd-commenter][redguardtoo/evil-nerd-commenter]]           |
| evil-numbers          | github    | github    | [[https://github.com/juliapath/evil-numbers][juliapath/evil-numbers]]                    |
| evil-visualstar       | github    | github    | [[https://github.com/bling/evil-visualstar][bling/evil-visualstar]]                     |
| flymake-kondor        | github    | github    | [[https://github.com/turbo-cafe/flymake-kondor][turbo-cafe/flymake-kondor]]                 |
| focus                 | github    | github    | [[https://github.com/larstvei/Focus][larstvei/Focus]]                            |
| forth-mode            | github    | github    | [[https://github.com/larsbrinkhoff/forth-mode][larsbrinkhoff/forth-mode]]                  |
| free-keys             | github    | github    | [[https://github.com/Fuco1/free-keys][Fuco1/free-keys]]                           |
| geiser                | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/geiser][emacs-geiser/geiser]]                       |
| geiser-chez           | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/chez][emacs-geiser/chez]]                         |
| geiser-chibi          | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/chibi][emacs-geiser/chibi]]                        |
| geiser-chicken        | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/chicken][emacs-geiser/chicken]]                      |
| geiser-gambit         | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/gambit][emacs-geiser/gambit]]                       |
| geiser-gauche         | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/gauche][emacs-geiser/gauche]]                       |
| geiser-guile          | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/guile][emacs-geiser/guile]]                        |
| geiser-kawa           | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/kawa][emacs-geiser/kawa]]                         |
| geiser-mit            | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/mit][emacs-geiser/mit]]                          |
| geiser-racket         | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/racket][emacs-geiser/racket]]                       |
| geiser-stklos         | gitlab    | gitlab    | [[https://gitlab.com/emacs-geiser/stklos][emacs-geiser/stklos]]                       |
| git-modes             | github    | github    | [[https://github.com/magit/git-modes][magit/git-modes]]                           |
| gnu-apl-mode          | github    | github    | [[https://github.com/lokedhs/gnu-apl-mode][lokedhs/gnu-apl-mode]]                      |
| gnuplot               | github    | github    | [[https://github.com/emacs-gnuplot/gnuplot][emacs-gnuplot/gnuplot]]                     |
| go-mode               | github    | github    | [[https://github.com/dominikh/go-mode.el][dominikh/go-mode.el]]                       |
| gotham-theme          | git       | git       | [[https://depp.brause.cc/gotham-theme]]       |
| goto-chg              | github    | github    | [[https://github.com/emacs-evil/goto-chg][emacs-evil/goto-chg]]                       |
| graphql-mode          | github    | github    | [[https://github.com/davazp/graphql-mode][davazp/graphql-mode]]                       |
| gruvbox-theme         | github    | github    | [[https://github.com/Greduan/emacs-theme-gruvbox][greduan/emacs-theme-gruvbox]]               |
| guru-mode             | github    | github    | [[https://github.com/bbatsov/guru-mode][bbatsov/guru-mode]]                         |
| haml-mode             | github    | github    | [[https://github.com/nex3/haml-mode][nex3/haml-mode]]                            |
| haskell-mode          | github    | github    | [[https://github.com/haskell/haskell-mode][haskell/haskell-mode]]                      |
| helm                  | github    | github    | [[https://github.com/emacs-helm/helm][emacs-helm/helm]]                           |
| highlight-parentheses | sourcehut | sourcehut | [[https://git.sr.ht/~tsdh/highlight-parentheses.el][tsdh/highlight-parentheses.el]]             |
| hl-block-mode         | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-hl-block-mode][ideasman42/emacs-hl-block-mode]]            |
| htmlize               | github    | github    | [[https://github.com/hniksic/emacs-htmlize][hniksic/emacs-htmlize]]                     |
| idle-highlight-mode   | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-idle-highlight-mode][ideasman42/emacs-idle-highlight-mode]]      |
| idris-mode            | github    | github    | [[https://github.com/idris-hackers/idris-mode][idris-hackers/idris-mode]]                  |
| iedit                 | github    | github    | [[https://github.com/victorhge/iedit][victorhge/iedit]]                           |
| inf-clojure           | github    | github    | [[https://github.com/clojure-emacs/inf-clojure][clojure-emacs/inf-clojure]]                 |
| inf-ruby              | github    | github    | [[https://github.com/nonsequitur/inf-ruby][nonsequitur/inf-ruby]]                      |
| inkpot-theme          | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-theme-inkpot][ideasman42/emacs-theme-inkpot]]             |
| j-mode                | github    | github    | [[https://github.com/zellio/j-mode][zellio/j-mode]]                             |
| jade-mode             | github    | github    | [[https://github.com/brianc/jade-mode][brianc/jade-mode]]                          |
| jinja2-mode           | github    | github    | [[https://github.com/paradoxxxzero/jinja2-mode][paradoxxxzero/jinja2-mode]]                 |
| julia-mode            | github    | github    | [[https://github.com/JuliaEditorSupport/julia-emacs][JuliaEditorSupport/julia-emacs]]            |
| keycast               | github    | github    | [[https://github.com/tarsius/keycast][tarsius/keycast]]                           |
| kotlin-mode           | github    | github    | [[https://github.com/Emacs-Kotlin-Mode-Maintainers/kotlin-mode][Emacs-Kotlin-Mode-Maintainers/kotlin-mode]] |
| lua-mode              | github    | github    | [[https://github.com/immerrr/lua-mode][immerrr/lua-mode]]                          |
| macrostep             | orphaned  | github    | [[https://github.com/emacsorphanage/macrostep][emacsorphanage/macrostep]]                  |
| magit                 | github    | github    | [[https://github.com/magit/magit][magit/magit]]                               |
| markdown-mode         | github    | github    | [[https://github.com/jrblevin/markdown-mode][jrblevin/markdown-mode]]                    |
| material-theme        | github    | github    | [[https://github.com/cpaulik/emacs-material-theme][cpaulik/emacs-material-theme]]              |
| mentor                | github    | github    | [[https://github.com/skangas/mentor][skangas/mentor]]                            |
| moe-theme             | github    | github    | [[https://github.com/kuanyui/moe-theme.el][kuanyui/moe-theme.el]]                      |
| monokai-theme         | github    | github    | [[https://github.com/oneKelvinSmith/monokai-emacs][oneKelvinSmith/monokai-emacs]]              |
| mpv                   | github    | github    | [[https://github.com/kljohann/mpv.el][kljohann/mpv.el]]                           |
| multiple-cursors      | github    | github    | [[https://github.com/magnars/multiple-cursors.el][magnars/multiple-cursors.el]]               |
| nasm-mode             | github    | github    | [[https://github.com/skeeto/nasm-mode][skeeto/nasm-mode]]                          |
| nginx-mode            | github    | github    | [[https://github.com/ajc/nginx-mode][ajc/nginx-mode]]                            |
| nix-mode              | github    | github    | [[https://github.com/NixOS/nix-mode][NixOS/nix-mode]]                            |
| oblivion-theme        | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-theme-oblivion][ideasman42/emacs-theme-oblivion]]           |
| opam-switch-mode      | github    | github    | [[https://github.com/ProofGeneral/opam-switch-mode][ProofGeneral/opam-switch-mode]]             |
| org-auto-tangle       | github    | github    | [[https://github.com/yilkalargaw/org-auto-tangle][yilkalargaw/org-auto-tangle]]               |
| org-contrib           | sourcehut | sourcehut | [[https://git.sr.ht/~bzg/org-contrib][bzg/org-contrib]]                           |
| org-drill             | gitlab    | gitlab    | [[https://gitlab.com/phillord/org-drill][phillord/org-drill]]                        |
| org-journal           | github    | github    | [[https://github.com/bastibe/org-journal][bastibe/org-journal]]                       |
| org-mime              | github    | github    | [[https://github.com/org-mime/org-mime][org-mime/org-mime]]                         |
| org-present           | github    | github    | [[https://github.com/rlister/org-present][rlister/org-present]]                       |
| org-superstar         | github    | github    | [[https://github.com/integral-dw/org-superstar-mode][integral-dw/org-superstar-mode]]            |
| org-tree-slide        | github    | github    | [[https://github.com/takaxp/org-tree-slide][takaxp/org-tree-slide]]                     |
| orgit                 | github    | github    | [[https://github.com/magit/orgit][magit/orgit]]                               |
| pacmacs               | github    | github    | [[https://github.com/codingteam/pacmacs.el][codingteam/pacmacs.el]]                     |
| paredit               | git       | git       |                                           |
| parseclj              | github    | github    | [[https://github.com/clojure-emacs/parseclj][clojure-emacs/parseclj]]                    |
| parseedn              | github    | github    | [[https://github.com/clojure-emacs/parseedn][clojure-emacs/parseedn]]                    |
| pcmpl-args            | github    | github    | [[https://github.com/JonWaltman/pcmpl-args.el][JonWaltman/pcmpl-args.el]]                  |
| pcre2el               | github    | github    | [[https://github.com/joddie/pcre2el][joddie/pcre2el]]                            |
| pdf-tools             | github    | github    | [[https://github.com/vedang/pdf-tools][vedang/pdf-tools]]                          |
| php-mode              | github    | github    | [[https://github.com/emacs-php/php-mode][emacs-php/php-mode]]                        |
| popup                 | github    | github    | [[https://github.com/auto-complete/popup-el][auto-complete/popup-el]]                    |
| projectile            | github    | github    | [[https://github.com/bbatsov/projectile][bbatsov/projectile]]                        |
| proof-general         | github    | github    | [[https://github.com/ProofGeneral/PG][ProofGeneral/PG]]                           |
| prop-menu             | github    | github    | [[https://github.com/david-christiansen/prop-menu-el][david-christiansen/prop-menu-el]]           |
| racket-mode           | github    | github    | [[https://github.com/greghendershott/racket-mode][greghendershott/racket-mode]]               |
| rainbow-delimiters    | github    | github    | [[https://github.com/Fanael/rainbow-delimiters][Fanael/rainbow-delimiters]]                 |
| raku-mode             | github    | github    | [[https://github.com/Raku/raku-mode][Raku/raku-mode]]                            |
| recomplete            | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-recomplete][ideasman42/emacs-recomplete]]               |
| request               | github    | github    | [[https://github.com/tkf/emacs-request][tkf/emacs-request]]                         |
| rfc-mode              | github    | github    | [[https://github.com/galdor/rfc-mode][galdor/rfc-mode]]                           |
| rubocop               | github    | github    | [[https://github.com/rubocop/rubocop-emacs][rubocop/rubocop-emacs]]                     |
| rust-mode             | github    | github    | [[https://github.com/rust-lang/rust-mode][rust-lang/rust-mode]]                       |
| sass-mode             | github    | github    | [[https://github.com/nex3/sass-mode][nex3/sass-mode]]                            |
| scad-mode             | github    | github    | [[https://github.com/openscad/emacs-scad-mode][openscad/emacs-scad-mode]]                  |
| scala-mode            | github    | github    | [[https://github.com/hvesalai/emacs-scala-mode][hvesalai/emacs-scala-mode]]                 |
| scroll-on-drag        | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-scroll-on-drag][ideasman42/emacs-scroll-on-drag]]           |
| scroll-on-jump        | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-scroll-on-jump][ideasman42/emacs-scroll-on-jump]]           |
| sesman                | github    | github    | [[https://github.com/vspinu/sesman][vspinu/sesman]]                             |
| shellcop              | github    | github    | [[https://github.com/redguardtoo/shellcop][redguardtoo/shellcop]]                      |
| slime                 | github    | github    | [[https://github.com/slime/slime][slime/slime]]                               |
| sly                   | github    | github    | [[https://github.com/joaotavora/sly][joaotavora/sly]]                            |
| smartparens           | github    | github    | [[https://github.com/Fuco1/smartparens][Fuco1/smartparens]]                         |
| solarized-theme       | github    | github    | [[https://github.com/bbatsov/solarized-emacs][bbatsov/solarized-emacs]]                   |
| spacemacs-theme       | github    | github    | [[https://github.com/nashamri/spacemacs-theme][nashamri/spacemacs-theme]]                  |
| spell-fu              | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-spell-fu][ideasman42/emacs-spell-fu]]                 |
| subatomic-theme       | github    | github    | [[https://github.com/cryon/subatomic][cryon/subatomic-theme]]                     |
| swift-mode            | github    | github    | [[https://github.com/swift-emacs/swift-mode][swift-emacs/swift-mode]]                    |
| symbol-overlay        | github    | github    | [[https://github.com/wolray/symbol-overlay][wolray/symbol-overlay]]                     |
| systemd               | github    | github    | [[https://github.com/holomorph/systemd-mode][holomorph/systemd-mode]]                    |
| tablist               | github    | github    | [[https://github.com/politza/tablist][politza/tablist]]                           |
| tangotango-theme      | github    | github    | [[https://github.com/juba/color-theme-tangotango][juba/color-theme-tangotango]]               |
| telephone-line        | github    | github    | [[https://github.com/dbordak/telephone-line][dbordak/telephone-line]]                    |
| textile-mode          | github    | github    | [[https://github.com/juba/textile-mode][juba/textile-mode]]                         |
| toc-org               | github    | github    | [[https://github.com/snosov1/toc-org][snosov1/toc-org]]                           |
| treeview              | github    | github    | [[https://github.com/tilmanrassy/emacs-treeview][tilmanrassy/emacs-treeview]]                |
| tuareg                | github    | github    | [[https://github.com/ocaml/tuareg][ocaml/tuareg]]                              |
| typescript-mode       | github    | github    | [[https://github.com/emacs-typescript/typescript.el][emacs-typescript/typescript.el]]            |
| ujelly-theme          | github    | github    | [[https://github.com/marktran/color-theme-ujelly][marktran/color-theme-ujelly]]               |
| undo-fu               | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-undo-fu][ideasman42/emacs-undo-fu]]                  |
| undo-fu-session       | codeberg  | codeberg  | [[https://codeberg.org/ideasman42/emacs-undo-fu-session][ideasman42/emacs-undo-fu-session]]          |
| vc-fossil             | github    | github    | [[https://github.com/venks1/emacs-fossil][venks1/emacs-fossil]]                       |
| visual-fill-column    | codeberg  | codeberg  | [[https://codeberg.org/joostkremers/visual-fill-column][joostkremers/visual-fill-column]]           |
| web-mode              | github    | github    | [[https://github.com/fxbois/web-mode][fxbois/web-mode]]                           |
| webpaste              | github    | github    | [[https://github.com/etu/webpaste.el][etu/webpaste.el]]                           |
| wgrep                 | github    | github    | [[https://github.com/mhayashi1120/Emacs-wgrep][mhayashi1120/Emacs-wgrep]]                  |
| with-editor           | github    | github    | [[https://github.com/magit/with-editor][magit/with-editor]]                         |
| with-simulated-input  | github    | github    | [[https://github.com/DarwinAwardWinner/with-simulated-input][DarwinAwardWinner/with-simulated-input]]    |
| ws-butler             | github    | github    | [[https://github.com/lewang/ws-butler][lewang/ws-butler]]                          |
| xml-rpc               | github    | github    | [[https://github.com/hexmode/xml-rpc-el][xml-rpc-el/xml-rpc-el]]                     |
| yaml-mode             | github    | github    | [[https://github.com/yoshiki/yaml-mode][yoshiki/yaml-mode]]                         |
| yasnippet-snippets    | github    | github    | [[https://github.com/AndreaCrotti/yasnippet-snippets][AndreaCrotti/yasnippet-snippets]]           |
| zenburn-theme         | github    | github    | [[https://github.com/bbatsov/zenburn-emacs][bbatsov/zenburn-emacs]]                     |
| zig-mode              | github    | github    | [[https://github.com/ziglang/zig-mode][ziglang/zig-mode]]                          |

* Melpa
:PROPERTIES:
:ID:       eff92541-4709-4bcf-bff1-2be1120ccfbd
:END:
** New
:PROPERTIES:
:ID:       80bbc73b-c1ad-4dc1-b86c-39e8f7b3bb70
:END:
#+name: melpa-new
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Class" "Melpa" "Link"))
  (seq-keep (pcase-lambda (`(,name ,fetcher ,url))
              (and (not (or (emir--lookup-url url)
                            (emir--config name :delayed)
                            (emir--config name :secondary)))
                   (list name
                         (and-let* ((class (emir--url-to-class url)))
                           (closql--abbrev-class class))
                         fetcher
                         (melpa-org-link name))))
            (epkg-sql [:select [name class url]
                       :from melpa-recipes
                       :where (isnull epkg-package)
                       :order-by [(asc url)
                                  (asc name)]]))
#+end_src
#+results: melpa-new

** Delayed
:PROPERTIES:
:ID:       5f94df6a-24e1-4e74-a16a-0649c669a526
:END:
#+name: melpa-delayed
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Melpa" "Reason"))
  (seq-keep (pcase-lambda (`(,name ,class))
              (and-let* ((reason (emir--config name :delayed)))
                (list name class reason)))
            (epkg-sql [:select [name class]
                       :from melpa-recipes
                       :where (isnull epkg-package)
                       :order-by [(asc name)]]))
#+end_src
#+results: melpa-delayed
| Package (3)     | Melpa  | Reason                                                    |
|-----------------+--------+-----------------------------------------------------------|
| connection      | github | Don't add; part of upstream dictionary but not Emacs 28.1 |
| django-snippets | github | Don't add; part of shelved django-mode                    |
| link            | github | Don't add; part of upstream dictionary but not Emacs 28.1 |

** Shelved
:PROPERTIES:
:ID:       ad356942-4584-4cef-8292-1cdba76e5845
:END:
#+name: melpa-shelved
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Url"))
  (epkg-sql [:select [packages:name packages:url]
             :from [packages melpa-recipes]
             :where (and (= melpa-recipes:epkg-package packages:name)
                         (in packages:class $v1))
             :order-by [(asc packages:name)]]
            [shelved])
#+end_src
#+results: melpa-shelved
| Package (33)                | Url                                                                         |
|-----------------------------+-----------------------------------------------------------------------------|
| angular-mode                | https://github.com/rudolfolah/angularjs-mode                                |
| bury-successful-compilation | https://github.com/EricCrosson/bury-successful-compilation.git              |
| color-theme                 | https://github.com/emacsorphanage/color-theme                               |
| company-go                  | https://github.com/nsf/gocode                                               |
| company-racer               | https://github.com/emacsorphanage/company-racer                             |
| django-mode                 | https://github.com/unrelentingtech/django-mode                              |
| drawille                    | https://github.com/josuah/drawille-el                                       |
| e2wm-R                      | https://github.com/myuhe/e2wm-R.el                                          |
| edit-at-point               | https://github.com/enoson/edit-at-point.el                                  |
| eno                         | https://github.com/enoson/eno.el                                            |
| flycheck-gometalinter       | https://github.com/favadi/flycheck-gometalinter.git                         |
| flycheck-julia              | https://github.com/gdkrmr/flycheck-julia                                    |
| fold-dwim                   | https://community.dur.ac.uk/p.j.heslin/Software/Emacs/Download/fold-dwim.el |
| fold-dwim-org               | https://github.com/mattfidler/fold-dwim-org                                 |
| go-autocomplete             | https://github.com/nsf/gocode                                               |
| help-find-org-mode          | https://github.com/EricCrosson/help-find-org-mode.git                       |
| ido-migemo                  | https://github.com/myuhe/ido-migemo.el                                      |
| inlineR                     | https://github.com/myuhe/inlineR.el                                         |
| journalctl-mode             | https://github.com/SebastianMeisel/journalctl-mode                          |
| lsp-python-ms               | https://github.com/emacs-lsp/lsp-python-ms                                  |
| magit-gh-pulls              | https://github.com/sigma/magit-gh-pulls                                     |
| mic-paren                   | http://www.gnuvola.org/software/j/mic-paren/mic-paren.el                    |
| org-doing                   | https://github.com/rudolfolah/org-doing                                     |
| org-multiple-keymap         | https://github.com/myuhe/org-multiple-keymap.el                             |
| org-wunderlist              | https://github.com/myuhe/org-wunderlist.el                                  |
| paradox                     | https://github.com/Malabarba/paradox.git                                    |
| qt-pro-mode                 | https://github.com/EricCrosson/qt-pro-mode.git                              |
| quick-preview               | https://github.com/myuhe/quick-preview.el                                   |
| redshank                    | http://www.foldr.org/~michaelw/projects/redshank.git                        |
| twtxt                       | https://github.com/deadblackclover/twtxt-el                                 |
| unkillable-scratch          | https://github.com/EricCrosson/unkillable-scratch.git                       |
| weechat                     | https://github.com/the-kenny/weechat.el                                     |
| weechat-alert               | https://github.com/Kungi/weechat-alert                                      |

** Shared repositories
:PROPERTIES:
:ID:       cb112869-6eb7-4a10-9d20-6868d2885461
:END:
#+name: secondary-packages
#+begin_src emacs-lisp :post addheader(*this*,'("Primary package" "Secondary package" "Class"))
  (epkg-sql [:select :distinct [packages:name
                                melpa-recipes:name
                                packages:class]
             :from [packages melpa-recipes]
             :where (= packages:name melpa-recipes:epkg-package)
             :and :not (= melpa-recipes:epkg-package
                          melpa-recipes:name)
             :order-by [(asc packages:name)
                        (asc melpa-recipes:name)]])
#+end_src
#+results: secondary-packages
| Primary package (131)   | Secondary package                 | Class     |
|-------------------------+-----------------------------------+-----------|
| 750words                | ox-750words                       | github    |
| ac-php                  | ac-php-core                       | github    |
| ac-php                  | company-php                       | github    |
| ameba                   | flycheck-ameba                    | github    |
| axiom-environment       | company-axiom                     | git       |
| axiom-environment       | ob-axiom                          | git       |
| biblio                  | biblio-core                       | github    |
| bibtex-completion       | helm-bibtex                       | github    |
| bibtex-completion       | ivy-bibtex                        | github    |
| bufler                  | helm-bufler                       | github    |
| button-lock             | wiki-nav                          | github    |
| calfw                   | calfw-cal                         | github    |
| calfw                   | calfw-howm                        | github    |
| calfw                   | calfw-ical                        | github    |
| calfw                   | calfw-org                         | github    |
| cardano-tx              | bech32                            | github    |
| cardano-tx              | cardano-wallet                    | github    |
| cardano-tx              | cbor                              | github    |
| cardano-tx              | ouroboros                         | github    |
| cardano-tx              | readable-numbers                  | github    |
| cfn-mode                | flycheck-cfn                      | gitlab    |
| chronometrist           | chronometrist-key-values          | codeberg  |
| chronometrist           | chronometrist-spark               | codeberg  |
| circe                   | tracking                          | github    |
| citar                   | citar-embark                      | github    |
| clojure-essential-ref   | clojure-essential-ref-nov         | github    |
| clojure-mode            | clojure-mode-extra-font-locking   | github    |
| codesearch              | projectile-codesearch             | github    |
| colorless-themes        | lavenderless-theme                | sourcehut |
| colorless-themes        | nordless-theme                    | sourcehut |
| copyit                  | copyit-pandoc                     | github    |
| crystal-mode            | flycheck-crystal                  | github    |
| ctl-mode                | gs-mode                           | github    |
| dash                    | dash-functional                   | github    |
| datetime-format         | timecop                           | github    |
| ddskk                   | ccc                               | github    |
| ddskk                   | cdb                               | github    |
| deferred                | concurrent                        | github    |
| dired-hacks             | dired-avfs                        | github    |
| dired-hacks             | dired-collapse                    | github    |
| dired-hacks             | dired-filter                      | github    |
| dired-hacks             | dired-hacks-utils                 | github    |
| dired-hacks             | dired-narrow                      | github    |
| dired-hacks             | dired-open                        | github    |
| dired-hacks             | dired-rainbow                     | github    |
| dired-hacks             | dired-ranger                      | github    |
| dired-hacks             | dired-subtree                     | github    |
| distel-completion-lib   | auto-complete-distel              | github    |
| distel-completion-lib   | company-distel                    | github    |
| dix                     | dix-evil                          | github    |
| dogears                 | helm-dogears                      | github    |
| dylan                   | dime                              | github    |
| eclim                   | ac-emacs-eclim                    | github    |
| eclim                   | company-emacs-eclim               | github    |
| el-secretario           | el-secretario-elfeed              | sourcehut |
| el-secretario           | el-secretario-mu4e                | sourcehut |
| el-secretario           | el-secretario-notmuch             | sourcehut |
| el-secretario           | el-secretario-org                 | sourcehut |
| elfeed                  | elfeed-web                        | github    |
| elfeed-tube             | elfeed-tube-mpv                   | github    |
| emacsql                 | emacsql-mysql                     | github    |
| emacsql                 | emacsql-pg                        | github    |
| emacsql                 | emacsql-psql                      | github    |
| emacsql                 | emacsql-sqlite                    | github    |
| emacsql                 | emacsql-sqlite-builtin            | github    |
| emacsql                 | emacsql-sqlite-module             | github    |
| embark                  | avy-embark-collect                | github    |
| embark                  | embark-consult                    | github    |
| espotify                | consult-spotify                   | codeberg  |
| espotify                | ivy-spotify                       | codeberg  |
| esqlite                 | esqlite-helm                      | github    |
| evil                    | evil-test-helpers                 | github    |
| ewal                    | ewal-doom-themes                  | github    |
| ewal                    | ewal-evil-cursors                 | github    |
| ewal                    | ewal-spacemacs-themes             | github    |
| flutter                 | flutter-l10n-flycheck             | github    |
| flx                     | flx-ido                           | github    |
| flycheck-aspell         | flymake-aspell                    | github    |
| flyspell-correct        | flyspell-correct-avy-menu         | github    |
| flyspell-correct        | flyspell-correct-helm             | github    |
| flyspell-correct        | flyspell-correct-ivy              | github    |
| flyspell-correct        | flyspell-correct-popup            | github    |
| friendly-shell          | friendly-remote-shell             | github    |
| friendly-shell          | friendly-shell-command            | github    |
| frimacs                 | ob-fricas                         | github    |
| fsharp-mode             | eglot-fsharp                      | github    |
| fuz                     | helm-fuz                          | github    |
| git-emacs               | git-blamed                        | github    |
| gitlab                  | helm-gitlab                       | github    |
| gitlab                  | ivy-gitlab                        | github    |
| go-mode                 | go-guru                           | github    |
| go-mode                 | go-rename                         | github    |
| groovy-mode             | grails-mode                       | github    |
| haskell-emacs           | haskell-emacs-base                | github    |
| haskell-emacs           | haskell-emacs-text                | github    |
| helm                    | helm-core                         | github    |
| historian               | ivy-historian                     | github    |
| hydra                   | lv                                | github    |
| indent-lint             | flycheck-indent                   | github    |
| islisp-mode             | inferior-islisp                   | gitlab    |
| ivy                     | counsel                           | github    |
| ivy                     | ivy-avy                           | github    |
| ivy                     | ivy-hydra                         | github    |
| ivy                     | swiper                            | github    |
| jade-mode               | stylus-mode                       | github    |
| jade-mode               | sws-mode                          | github    |
| jedi                    | jedi-core                         | github    |
| jump                    | inflections                       | github    |
| kaesar                  | kaesar-file                       | github    |
| kaesar                  | kaesar-mode                       | github    |
| kaleidoscope            | kaleidoscope-evil-state-flash     | git       |
| keg                     | flycheck-keg                      | github    |
| keg                     | keg-mode                          | github    |
| kubel                   | kubel-evil                        | github    |
| kubernetes              | kubernetes-evil                   | github    |
| lean-mode               | company-lean                      | github    |
| lean-mode               | helm-lean                         | github    |
| load-theme-buffer-local | color-theme-buffer-local          | github    |
| loopy                   | loopy-dash                        | github    |
| lurk-mode               | ob-lurk                           | github    |
| mac-pseudo-daemon       | osx-pseudo-daemon                 | github    |
| magit                   | git-commit                        | github    |
| magit                   | magit-section                     | github    |
| major-mode-hydra        | pretty-hydra                      | github    |
| maxima                  | company-maxima                    | gitlab    |
| merlin                  | merlin-ac                         | subtree   |
| merlin                  | merlin-company                    | subtree   |
| merlin                  | merlin-iedit                      | subtree   |
| metal-archives          | metal-archives-shopping-list      | github    |
| monorepo-cadadr         | bibliothek                        | github    |
| monorepo-cadadr         | forecast                          | github    |
| monorepo-cadadr         | org-variable-pitch                | github    |
| monorepo-cadadr         | paper-theme                       | github    |
| monorepo-zenitani       | smart-compile                     | github    |
| nameframe               | nameframe-perspective             | github    |
| nameframe               | nameframe-project                 | github    |
| nameframe               | nameframe-projectile              | github    |
| nand2tetris             | company-nand2tetris               | github    |
| nand2tetris             | nand2tetris-assembler             | github    |
| native-complete         | company-native-complete           | github    |
| nixos-options           | company-nixos-options             | github    |
| nixos-options           | helm-nixos-options                | github    |
| nixos-options           | nix-sandbox                       | github    |
| opener                  | evil-opener                       | github    |
| org-multi-wiki          | helm-org-multi-wiki               | github    |
| org-pdftools            | org-noter-pdftools                | github    |
| org-projectile          | org-category-capture              | github    |
| org-projectile          | org-projectile-helm               | github    |
| org-ql                  | helm-org-ql                       | github    |
| org-recent-headings     | helm-org-recent-headings          | github    |
| org-starter             | org-starter-swiper                | github    |
| org2blog                | metaweblog                        | github    |
| ox-twiki                | ox-tiddly                         | github    |
| package-lint            | package-lint-flymake              | github    |
| pest-mode               | flycheck-pest                     | github    |
| pest-mode               | flymake-pest                      | github    |
| phpactor                | company-phpactor                  | github    |
| phpstan                 | flycheck-phpstan                  | github    |
| phpstan                 | flymake-phpstan                   | github    |
| pig-mode                | pig-snippets                      | github    |
| pollen-mode             | company-pollen                    | github    |
| prescient               | company-prescient                 | github    |
| prescient               | corfu-prescient                   | github    |
| prescient               | ivy-prescient                     | github    |
| prescient               | selectrum-prescient               | github    |
| prescient               | vertico-prescient                 | github    |
| processing-mode         | processing-snippets               | github    |
| prosjekt                | dirtree-prosjekt                  | github    |
| prosjekt                | helm-prosjekt                     | github    |
| psalm                   | flycheck-psalm                    | github    |
| request                 | request-deferred                  | github    |
| restclient              | restclient-helm                   | github    |
| restclient              | restclient-jq                     | github    |
| rinari                  | ruby-compilation                  | github    |
| ripgrep                 | projectile-ripgrep                | github    |
| rtags                   | ac-rtags                          | github    |
| rtags                   | company-rtags                     | github    |
| rtags                   | flycheck-rtags                    | github    |
| rtags                   | helm-rtags                        | github    |
| rtags                   | ivy-rtags                         | github    |
| rtags                   | rtags-xref                        | github    |
| semaphore               | semaphore-promise                 | github    |
| sift                    | projectile-sift                   | github    |
| smart-mode-line         | smart-mode-line-powerline-theme   | github    |
| solidity-mode           | company-solidity                  | github    |
| solidity-mode           | solidity-flycheck                 | github    |
| sourcekit               | company-sourcekit                 | github    |
| speechd                 | speechd-el                        | github    |
| springboard             | ido-springboard                   | github    |
| stan-mode               | company-stan                      | github    |
| stan-mode               | eldoc-stan                        | github    |
| stan-mode               | flycheck-stan                     | github    |
| stan-mode               | stan-snippets                     | github    |
| term-manager            | term-projectile                   | github    |
| tern                    | tern-auto-complete                | github    |
| tree-edit               | evil-tree-edit                    | github    |
| tree-sitter             | tsc                               | github    |
| treemacs                | treemacs-all-the-icons            | github    |
| treemacs                | treemacs-evil                     | github    |
| treemacs                | treemacs-icons-dired              | github    |
| treemacs                | treemacs-magit                    | github    |
| treemacs                | treemacs-persp                    | github    |
| treemacs                | treemacs-perspective              | github    |
| treemacs                | treemacs-projectile               | github    |
| treemacs                | treemacs-tab-bar                  | github    |
| use-package             | bind-chord                        | github    |
| use-package             | bind-key                          | github    |
| use-package             | use-package-chords                | github    |
| use-package             | use-package-ensure-system-package | github    |
| vdm-mode                | flycheck-vdm                      | github    |
| vdm-mode                | vdm-comint                        | github    |
| vdm-mode                | vdm-snippets                      | github    |
| w3m                     | shimbun                           | github    |
| wgrep                   | wgrep-ack                         | github    |
| wgrep                   | wgrep-ag                          | github    |
| wgrep                   | wgrep-helm                        | github    |
| wgrep                   | wgrep-pt                          | github    |
| window-jump             | spaces                            | github    |
| window-jump             | splitter                          | github    |
| xwwp                    | xwwp-follow-link-helm             | github    |
| xwwp                    | xwwp-follow-link-ivy              | github    |
| ycm                     | company-ycm                       | github    |
| ycmd                    | company-ycmd                      | github    |
| ycmd                    | flycheck-ycmd                     | github    |
| zetteldesk              | zetteldesk-info                   | github    |
| zetteldesk              | zetteldesk-kb                     | github    |
| zetteldesk              | zetteldesk-ref                    | github    |
| zetteldesk              | zetteldesk-remark                 | github    |
| zettelkasten            | org-zettelkasten                  | github    |
| zk                      | zk-desktop                        | github    |
| zk                      | zk-index                          | github    |

** Diverging repositories
:PROPERTIES:
:ID:       493d7e47-cfad-4cbe-b8fb-643a63306fe5
:END:
#+name: melpa-diverging-repositories
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Mirror" "" "Melpa" ""))
  (mapcar (pcase-lambda (`(,name ,type ,url ,fetcher ,murl))
            (list name type (epkg-org-link name) fetcher (melpa-org-link name)))
          (emir-melpa--migrated-packages))
#+end_src
#+results: melpa-diverging-repositories

** Diverging branches
:PROPERTIES:
:ID:       4739083e-ce34-4e33-84e5-f9bfd77b218f
:END:
#+name: melpa-diverging-branches
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Used" "Forced" "Melpa" "Class" "Fetcher" "Repo"))
  (mapcar (pcase-lambda (`(,name . ,rest))
            `(,name ,@rest ,(epkg-org-link name)))
          (emir-melpa--diverging-branches))
#+end_src
#+results: melpa-diverging-branches
| Package (4)       | Used   | Forced | Melpa   | Class  | Fetcher | Repo                                |
|-------------------+--------+--------+---------+--------+---------+-------------------------------------|
| elnode            | master |        | melpa   | github | github  | [[https://github.com/jcaw/elnode][jcaw/elnode]]                         |
| prettier          | master |        | release | github | github  | [[https://github.com/jscheid/prettier.el][jscheid/prettier.el]]                 |
| tree-sitter       | master |        | release | github | github  | [[https://github.com/emacs-tree-sitter/elisp-tree-sitter][emacs-tree-sitter/elisp-tree-sitter]] |
| tree-sitter-langs | master |        | release | github | github  | [[https://github.com/emacs-tree-sitter/tree-sitter-langs][emacs-tree-sitter/tree-sitter-langs]] |

- elnode:
  https://github.com/jcaw/elnode/issues/1
  https://github.com/melpa/melpa/issues/6184
- prettier: https://github.com/melpa/melpa/pull/6990#issuecomment-651687425
- tree-sitter*: https://github.com/emacs-tree-sitter/elisp-tree-sitter/issues/237

** From Emacsmirror
:PROPERTIES:
:ID:       df84d811-660f-4800-9cad-5e34c7b6ae9b
:END:
#+name: melpa-from-mirror
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Url"))
  (epkg-sql [:select [name url] :from melpa-recipes
             :where (like url '"\"https://github.com/emacsmirror%")
             :order-by [(asc name)]])
#+end_src
#+results: melpa-from-mirror
| Package (10)      | Url                                              |
|-------------------+--------------------------------------------------|
| auctex-latexmk    | https://github.com/emacsmirror/auctex-latexmk    |
| clang-format      | https://github.com/emacsmirror/clang-format      |
| darcsum           | https://github.com/emacsmirror/darcsum           |
| dsvn              | https://github.com/emacsmirror/dsvn              |
| edit-list         | https://github.com/emacsmirror/edit-list         |
| helm-ls-svn       | https://github.com/emacsmirror/helm-ls-svn       |
| highlight         | https://github.com/emacsmirror/highlight         |
| po-mode           | https://github.com/emacsmirror/po-mode           |
| quack             | https://github.com/emacsmirror/quack             |
| tex-smart-umlauts | https://github.com/emacsmirror/tex-smart-umlauts |

** From Emacsattic
:PROPERTIES:
:ID:       0b98c697-7373-40b2-8096-f71c9457cf55
:END:
#+name: melpa-from-attic
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Url"))
  (epkg-sql [:select [name url] :from melpa-recipes
             :where (like url '"\"https://github.com/emacsattic%")])
#+end_src
#+results: melpa-from-attic
| Package (18)        | Url                                               |
|---------------------+---------------------------------------------------|
| angular-mode        | https://github.com/emacsattic/angular-mode        |
| color-theme         | https://github.com/emacsattic/color-theme         |
| company-go          | https://github.com/emacsattic/company-go          |
| company-racer       | https://github.com/emacsattic/company-racer       |
| drawille            | https://github.com/emacsattic/drawille            |
| e2wm-R              | https://github.com/emacsattic/e2wm-R              |
| edit-at-point       | https://github.com/emacsattic/edit-at-point       |
| eno                 | https://github.com/emacsattic/eno                 |
| fold-dwim           | https://github.com/emacsattic/fold-dwim           |
| go-autocomplete     | https://github.com/emacsattic/go-autocomplete     |
| ido-migemo          | https://github.com/emacsattic/ido-migemo          |
| inlineR             | https://github.com/emacsattic/inlineR             |
| mic-paren           | https://github.com/emacsattic/mic-paren           |
| org-doing           | https://github.com/emacsattic/org-doing           |
| org-multiple-keymap | https://github.com/emacsattic/org-multiple-keymap |
| org-wunderlist      | https://github.com/emacsattic/org-wunderlist      |
| quick-preview       | https://github.com/emacsattic/quick-preview       |
| redshank            | https://github.com/emacsattic/redshank            |

* Github                                                           :noexport:
:PROPERTIES:
:ID:       402d9d91-94f5-4412-b57d-1dd0ae9adc55
:END:
** Archived repositories
:PROPERTIES:
:ID:       a621dd5e-a206-4dad-b03f-deb33c0960db
:END:
#+name: github-archived
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Repository" "Melpa" "Dependants"))
  (mapcar (pcase-lambda (`(,name ,downloads))
            (list name (epkg-org-link name) downloads
                  (mapconcat #'car (epkg-reverse-dependencies name) " ")))
          (epkg-sql [:select [name downloads] :from packages
                     :where (= upstream-state 'archived)
                     :order-by [(asc name)]]))
#+end_src
#+results: github-archived
| Package (1) | Repository            | Melpa | Dependants |
|-------------+-----------------------+-------+------------|
| helm-ctest  | [[https://github.com/danlamanna/helm-ctest][danlamanna/helm-ctest]] | 14029 |            |

** Removed repositories
:PROPERTIES:
:ID:       c9985064-5573-4119-acd0-5b8bf08902ae
:END:
#+name: github-removed
#+begin_src emacs-lisp :post addheader(*this*,'("Package" "Repository" "Melpa" "Dependants"))
  (mapcar (pcase-lambda (`(,name ,downloads))
            (list name (epkg-org-link name) downloads
                  (mapconcat #'car (epkg-reverse-dependencies name) " ")))
          (epkg-sql [:select [name downloads] :from packages
                     :where (= upstream-state 'removed)
                     :order-by [(asc name)]]))
#+end_src
#+results: github-removed
